{
  "collection": {
    "6 nimmt!": {
      "minplayers": 3,
      "maxplayers": 10,
      "duration": 30,
      "photo": "6nimmt.jpg",
      "comment": "Herr Kramer has taken a risk with this packaging.  First, he has kept the German title of the game which invariably gets heard as \"sex nymph.\"  Wait.  Maybe that's not entirely a risk.  Second, he labels his game as categorically not for bullheaded people.  In this country, that excludes literally everyone except for me, obviously, since I bought the game and therefore am not bullheaded.<br/><br/>Or maybe he's saying: for bullheaded people, 6 nimmt! is not a game.  It is not something they trifle with.  6 nimmt! is a <i>calling</i>, a <i>lifestyle</i>, something so core to their identity that to call it a \"game\" would be to trivialize their whole existence.",
      "dateUpdated": "11 Sep 2018"
    },
    "Akrotiri": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 45,
      "photo": "Akrotiri.jpg",
      "comment": "Akrotiri is another 2 player tile layer that lives on my bookshelf upstairs.  The idea is to construct the map in such a way so as to unearth hidden temples based on a hand of map cards.  In addition to that, each island also produces goods that can be sold to buy more maps.  And also each player has a hand of goal cards that reward points at the end of the game based on the location of their temples.  I've played three times and the difficulty with setting up temple locations is high enough that actual strategy or consideration for the end-game bonuses becomes nothing but a goal for future sessions.  I'd like to have those future sessions.  Won't you join me?",
      "dateUpdated": "12 Sep 2018"
    },
    "Amun-Re": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 90,
      "photo": "AmunRe.jpg",
      "comment": "Amun-Re is another auction game with an Egyptian Theme (and why not).  Truthfully, I've never played it but I picked up a copy when this classic got a snazzed up reprint with resin pyramids.  Plus, I like the designers <i>other</i> auction games with Egyptian Themes so I figured why not.  This game also plays great with 5 players which can be a bit of a sticky player count.  Anyway, each round players bid on provinces near the Nile river delta and then farm those provinces and put pyramids in them.  At the end of the age you'll get points for how impressive your provinces are.  During the second age, however, those pyramids will still be there but all ownership is rescinded and an auction for each province begins again.  What fun!",
      "dateUpdated": "21 Sep 2018"
    },
    "Azul": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "Azul.jpg",
      "comment": "Obviously you've all heard of Azul since it won the 2018 Spiel Des Jahres so I'll just mention that the hype is real, and it's a wonderful game.  I will likely only play it 2-player so I can have a greater chance of control in how I eventually create a mess of things.",
      "dateUpdated": "27 Sep 2018"
    },
    "Battlestar Galactica": {
      "minplayers": 4,
      "maxplayers": 7,
      "duration": 180,
      "photo": "BattlestarGalactica.jpg",
      "comment": "In 2010, I watched the entire series of the Battlestar Galactica reboot and, lucky for Jeff, he came along for the ride.  As I nerdily websearched for more Battlestar Galacti-fun I discovered that there was a board game and that it was published right here in Minnesota!  I then went on to buy like a billion board games but BSG is one of the OGs and it's stayed in my collection this whole time because it's so fun.  I will say the first few times I played it, it was a total disaster.  But!  I found a great teaching guide and now it makes so much more sense.  It's fun to be a cylon and cause chaos and also fun to try to sniff out the traitors in your midst all while pretending to be flying around the galaxy.",
      "dateUpdated": "18 Sep 2018"
    },
    "Biblios": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "Biblios.jpg",
      "comment": "Biblios is a quick stock trading/value speculation game around monks and the kinds of things they find valuable: ink and forbidden tomes and the like (where is the beer?  Monks love beer).  The first half of the game players act like some kind of monastic Hogwarts Sorting Hat as each player splits a set of cards among himself, his opponents and a future auction deck.  The second half involves auctioning off each card in the auction deck&mdash;sometimes turning money into stocks and sometimes getting rid of stocks to free up some liquid capital.  At any time, you may find yourself wielding a papal decree thereby sabotaging or buffeting the value of a certain class of goods.<br/><br/>Biblios is one of my favorite short games.  There's a push your luck element in the first half as you give away a mediocre card, hoping for something better, and there's a psychological manipulation element to the second half as you try to force someone to overpay for something they really want.  All this is a very snappy package.  Big fun for this big fan.",
      "dateUpdated": "12 Sep 2018" 
    },
    "Botswana": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 20,
      "photo": "Botswana.jpg",
      "comment": "Botswana comes with 25 plastic animal figurines so already you know it's going to be a great time.  It's a quick game of speculation and reading your opponents&mdash;a common theme for games in my collection!",
      "dateUpdated": "16 Sep 2018"
    },
    "The Bridges of Shangri-La": {
      "minplayers": 3,
      "maxplayers": 4,
      "duration": 60,
      "photo": "BridgesOfShangriLa.jpg",
      "comment": "It's always fun to buy a game (used), give that game away, and then re-buy that game (used).  It's like I'm personifying the theory of Capitalism as value in motion.  Anyway, this old game was recommended as something 'simple and mean' which, like 'cute and mean' is one of my favorite combos in a game.  It's a game of majorities and burnt bridges.  I'm curious as to whether this game will suffer from a 'two people duke it out and the one left over wins' problem, but the only way to find out is to play it more, so let's do that.",
      "dateUpdated": "27 Sep 2018"
    },
    "Chicago Express": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 60,
      "photo": "ChicagoExpress.jpg",
      "comment": "Chicago Express is a distilled train and stock game that affords you very little ability to predict the long term consequences of your actions.  The rules explanation and game play are quick which make this an easy one to pick up, just, don't ask me for strategy tips because I always lose!  One of my favorite games.",
      "dateUpdated": "16 Sep 2018"
    },
    "Clippers": {
      "minplayers": 4,
      "maxplayers": 5,
      "duration": 60,
      "photo": "Clippers.jpg",
      "comment": "From the guy who brought you Ticket to Ride comes the game that inspired one of my all time favorite comments on BoardGameGeek: 'Multiple players have described these games [games where opponents sabotage plans] as the single most frustrating experience in their lives and have publicly wondered why homicides were not committed in those games as the red slowly flooded their face and their teeth ground into dust.'  How could I not pick up a copy?",
      "dateUpdated": "19 Sep 2018"
    },
    "Codenames Duet": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 15,
      "photo": "CodenamesDuet.jpg",
      "comment": "In 2000, Bruce Paltrow directed his goop founding daughter in the musical romp Duets.  17 years later, the spiritual successor to that movie was released in Codenames Duet: the cooperative take on board game mega-hit Codenames.  The game is a little bit more fun and involved than just playing Codenames without an opposing team but the core game play is still there, except each person alternates giving clues and guessing cards.  The key cards are double sided and set up so this all makes sense.  It's kind of neat?",
      "dateUpdated": "13 Sep 2018"
    },
    "Codenames Pictures": {
      "minplayers": 4,
      "maxplayers": 8,
      "duration": 15,
      "photo": "CodenamesPictures.jpg",
      "comment": "The competitive version of Codenames I own is this one, the picture one.  It has a few things going for it that make it a more fun game (although I should point out I think everyone else thinks this is, if not worse, not better than the original).  First, the board is smaller so there's a higher likelihood of finding the assassin which I think is fun (and also games are over quicker).  Second, I've found it easier to come up with clues in this version (eg. if I'm blue in the above picture my clue is 'Legs 3') and that also speeds things up&mdash;fewer threats of the sand timer.  And Third the pictures spark some fun convo.",
      "dateUpdated": "13 Sep 2018"
    },
    "Coney Island": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 45,
      "photo": "",
      "comment": "This game gives me the opportunity to quote Meryl Streep in Sophie's Choice: \"Coney Island, oh boy!\"",
      "dateUpdated": "22 Sep 2018"
    },
    "Container": {
      "minplayers": 4,
      "maxplayers": 5,
      "duration": 90,
      "photo": "Container.jpg",
      "comment": "I was drawn to Container when I read descriptions about how fragile the in-game economy can be; that players can actually create a situation where the amount of money in circulation isn't enough for the game to continue.  I'm still fascinated by that and by this game although I don't think I've been able to play it in 5 years.  The idea is we are all running different kinds of vertically integrated shipping company that require the other players as customers to function.  I might produce a container that gets bought by someone else to put in their warehouse that then gets bought by another player to put on a ship and then I may turn around and buy the container I produced when it gets brought to market.  I love this interleaving of incentives because it makes psychology a big part of the game.  Let's give it a try!",
      "dateUpdated": "19 Sep 2018"
    },
    "Crokinole": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "Crokinole.jpg",
      "comment": "What is that object demurely hiding behind that tasteful (fake) interior greenery? \"Is it a game or art?\" you may ask.  I reply, \"Please stop limiting yourself with unhelpful binaries.\"  Crokinole is the/a national game of Canada thus, as Minnesota is arguably Canada, it is one of the 120+ of our household games.  It's shuffleboard!  On your table top!  My board's name is \"Connor\".",
      "dateUpdated": "11 Sep 2018"
    },
    "Divinare": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "Divinare.jpg",
      "comment": "Divinare (which is pronounced with four syllables) gives you the chance to <i>finally</i> live out your <a href=\"https://www.youtube.com/watch?v=g1Ry_GhRrM4\" target=\"_blank\">Madam Ruby</a> fantasies.  The idea here is to deduce the makeup of a deck of cards based on what you hold in your hand and what you and your opponents play.  The twist is half way through the round you pass a certain number of cards to the player on your right.  I have a third eye occlusion so normally don't do very well.",
      "dateUpdated": "13 Sep 2018"
    },
    "Die Dolmengötter": {
      "minplayers": 4,
      "maxplayers": 4,
      "duration": 30,
      "photo": "",
      "comment": "Talk about an off the beaten path game in my collection!  The game takes drug-taking pooping druids for its theme and shared incentives as its mechanism.  How could I resist?",
      "dateUpdated": "25 Sep 2018"
    },
    "Dominant Species": {
      "minplayers": 2,
      "maxplayers": 6,
      "duration": 180,
      "photo": "",
      "comment": "Dominant Species was probably my first 'favorite game' when I got seriously into the hobby around 2010.  It's a long and brutal game that requires contingency planning and continual adjustment of expectations.  Mechanically, it's worker placement and area control amid an evolutionary themed chaotic system.  It takes a lot of time and a lot of attention so hasn't been played much since its early hey-day but it has a special place in my game closet regardless: right next to all the other board games.",
      "dateUpdated": "25 Sep 2018"
    },
    "Finca": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 45,
      "photo": "",
      "comment": "",
      "dateUpdated": "25 Sep 2018"
    },
    "Fjords": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 30,
      "photo": "Fjords.jpg",
      "comment": "A hex-tile laying, positionally speculative game with a Nordic setting?  Yes please.  The only criticism is that the box should have came with twice as many tiles!",
      "dateUpdated": "12 Sep 2018"
    },
    "For Sale": {
      "minplayers": 3,
      "maxplayers": 6,
      "duration": 20,
      "photo": "ForSale.jpg",
      "comment": "If living through the subprime mortgage crisis of 2008 wasn't enough fun for you, For Sale gives you the chance to feel like one of the perpetrators!  And just like in real life, you won't be put in jail.  For Sale is a game with two phases: buy low and sell high.  First, slates of houses ranging from igloo to international space station are put up for auction and then players try to flip those properties on markets of varying demand.  The player with the most money wins.  This is one of my favorite 'filler' length games.<br/><br/>Ok so can we really call housing market speculators perpetrators of the crisis or just, sort of, parties to it?  I mean, it's not like this game is about giving a certain asset class a AAA rating it doesn't deserve, right?  Where's THAT game?",
      "dateUpdated": "13 Sep 2018"
    },
    "Gaia Project": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 120,
      "photo": "GaiaProject.jpg",
      "comment": "Gaia Project will probably be one of the exhibits the people bring in their case against Joe Using BoardGameGeek dot com because there's really no reason I should own it but I do because of shit I read on that site.  It's a 'Terra Mystica' game which, if you read <a href=\"https://playingjoesgames.wordpress.com\" target=\"_blank\">the blog</a> I started for my sister's coworkers to document the games I've given them that they've played, you'll notice Terra Mystica is no longer in my collection.  However, upon seeing Gaia Project's better theme (space vs. fantasy), variable map, and reviews touting its improvement on its forefather, I decided 'What the heck' and picked it up.  That said, if this kind of thing looks awesome please let me know and I'll actually read the rules.  I do enjoy a space-themed grand strategy game here and there.",
      "dateUpdated": "21 Sep 2018"
    },
    "A Game of Thrones": {
      "minplayers": 4,
      "maxplayers": 6,
      "duration": 180,
      "photo": "AGameOfThrones.jpg",
      "comment": "A Game of Thrones is the perfect antidote to all those times you had to slog through trying to dislodge someone in Australia in your childhood games of Risk.  You play as one of the six major houses of Westeros vying for the Iron Throne.  You will make alliances and you will break those alliances.  This is the kind of game where I have to explicitly declaim that what happens during the game cannot be taken personally after the game is over because betrayal is one of the main appeals of this game.",
      "dateUpdated": "19 Sep 2018"
    },
    "Glass Road": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 45,
      "photo": "GlassRoad.jpg",
      "comment": "Glass Road takes the classic board game standby of Gather Resources to turn them Into Victory points and adds a few fun twists.  The wheel pictured above is one of those twists in that certain resources will <i>automatically</i> convert to other, more valuable ones (for better or worse) and the other is an identical set of action cards given to each player from which they will choose their round's actions.  Should another player have chosen the same action, each player will only be able to execute that action at half strength.  When I play, I like to keep in mind what my opponent likes to do and select that action for the round even if it's not something I particularly need, I just don't want her to get the full action benefit.  Yes, that's the kind of person I am, and I'm glad this game exists for me to have learned that lesson about myself.",
      "dateUpdated": "24 Sep 2018"
    },
    "Grand Cru": {
      "minplayers":2,
      "maxplayers":5,
      "duration":90,
      "photo":"GrandCru.jpg",
      "comment": "A game about wine with 'brutal' game play wasn't going to stay out of my collection very long.  I've not played this yet but it has so many cardboard chits with syrah, merlot, pinor noir and the like that I am getting thirsty just thinking about it.  'Wine' and 'brutal' also remind me of my three years as a wine clerk.  Memories!",
      "dateUpdated": "19 Sep 2018"
    },
    "Great Western Trail": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 120,
      "photo": "GreatWesternTrail.jpg",
      "comment": "The box comes adorned with three uncanny valley looking dudes ready to start some trouble at the android OK Corral and with a label that this game is part of a 'Great Designers Series.'  The same designer did local favorite <b><a href=\"/collection/Port Royal\">Port Royal</a></b> but this behemoth is in a much different league.  It took three separate rules readings to get the the game down but despite the overhead the actual game plays quickly and smoothly.  The players act as 19th century American ranchers trying to breed the best herd of cattle to ship out west.  Ludologically this means it has some deck building, some resource management and some skill improvement aspects.  It's an engaging game even if for the first few plays you'll feel like you're making random moves.  Maybe even after the first few plays!",
      "dateUpdated": "15 Sep 2018"
    },
    "The Great Zimbabwe": {
      "minplayers": 2,
      "maxplayers": 5,
      "duration": 90,
      "photo": "",
      "comment": "If there's a gaming judgement day, my biggest sin will probably be not playing this game enough.  From what I hear it plays well at every player count (I've only played once, with 5) and offers some awesome spatial and logistical reasoning challenges which I love (who doesn't).",
      "dateUpdated": "25 Sep 2018"
    },
    "Greentown": {
      "minplayers": 3,
      "maxplayers": 3,
      "duration": 60,
      "photo": "",
      "comment": "",
      "dateUpdated": "25 Sep 2018"
    },
    "Hab & Gut": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 45,
      "photo": "HabGut.jpg",
      "comment": "So I wanted this game enough I sent a prayer and some money to a Taiwanese gaming company to secure a copy.  Never published in an English version, Hab & Gut has everything in a game that I generally love: a stock market you can only obliquely control and a fun punishment for those who don't give enough to charity.  It's not a complicated game but each little decision can have a huge effect.  I love that.",
      "dateUpdated": "23 Sep 2018"
    },
    "Hanamikoji": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 15,
      "photo": "Hanamikoji.jpg",
      "comment": "Do I even need to supply a comment with such an evocative photo?  Hanamikoji is a duel to see who can woo charming Japanese ladies, I guess.  Over three rounds, you use your collection of gifts (cards) to strategically out-romance your opponent.  Each round you have four and exactly four actions you must take, and two of these actions result in the sharing of cards with your opponent.  It's a quick and tense game as you try to make the most of the creative constraints the game provides.  4 out of 4 Weebs recommend.",
      "dateUpdated": "11 Sep 2018"
    },
    "Hey, That's My Fish!": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 20,
      "photo": "HeyThatsMyFish.jpg",
      "comment": "The icy façade of this adorable game belies a fiery opportunity for some hurt feelings, thereby making this one of my favorite games and many other people's least favorite game.  I have schelpped this box of fun to dive bars all the way from Northeast to the far reaches of the North Loop.  Unsurprisedly I lost a tile along the way.  No matter, though, because despite being a few tiles short of a full load (the game, not the owner), and despite taking longer to set up than to actually play, this game will always have a special place in my cold, dead heart.",
      "dateUpdated": "11 Sep 2018"
    },
    "Iron Curtain": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 20,
      "photo": "IronCurtain.jpg",
      "comment": "When I started getting into board games, the preeminated board game website had a game called Twilight Struggle ranked #1 best game all time.  Of course, being a profligate board game purchaser, I snatched up a copy.  I think that game is amazing: evocative of the cold war era in both theme and mechanics and endless strategical nuance.  Unfortunately, as a profilate board game purchaser, I never had the time to adequately dedicate myself to uncovering those strategic nuances and found myself enjoying the game less because I knew I would never be able to see it shine as brightly as it could if I just played it more often.  With all that said, Landon now has my copy of Twilight Struggle and <i>I</i> have this copy of Iron Curtain!  Iron Curtain attempts to distill the tug of (cold) war that is Twilight Struggle into an 18-card deck and from my brief experience with it, it does a solid job.  It may not have the depth that its progenitor has, but it likely has enough for the amount of table time I am able to give it.",
      "dateUpdated": "26 Sep 2018"
    },
    "Khmer": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 20,
      "photo": "Khmer.jpg",
      "comment": "First off, the photo on my phone is crystal clear.  I blame jpeg for blurring it up when I make it small enough to fit on my free hosting solution.  Anyway, Khmer is another short but great 2 player card game I have on my upstairs bookshelf.  Each round deals out 10 of the 16 cards (that's all this game is! 16 cards!) and the goal is to get your hand closest to the value of the pot in the center without going over when someone knocks to end the round.  Armed with a little memory, probability theory and ESP you will have yourself a victory.",
      "dateUpdated": "11 Sep 2018"
    },
    "King of Siam": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "",
      "comment": "King of Siam is a short and dense area control game that usually leaves my brain burning after just a half hour of game play.",
      "dateUpdated": "22 Sep 2018"
    },
    "Lost Cities": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 30,
      "photo": "LostCities.jpg",
      "comment": "Billed as 'The Original Card Game,' Lost Cities offers up an advertised 5 out of 5 on the Card Tactics scale which is a measurement everyone is familiar with.  Lost Cities is a risk-taking hand-management card game about setting forth on risky archaeological adventures and hoping those adventures pay off before the deck runs out.  Generally I end up losing as I am both too risky and not brave enough.",
      "dateUpdated": "12 Sep 2018"
    },
    "Love Letter": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 20,
      "photo": "LoveLetter.jpg",
      "comment": "Princess Annette's mother has been arrested for High Treason and instead of throwing yourself on the gears of the government to protest this injustice you have taken to writing creepy letters to the Princess to try to cheer her up.  The only problem is literally everyone in the castle knows what a weirdo you are and is trying to stop you, even the peeping tom Priest!  That said, the princess apparently discusses your letters affectionately over her morning croque madame if she can actually get them.  Your job is to make sure your letter, and not the letters of your opposing Lotharios, make it in to her hands.<br/><br/>How does the game play?  Draw a card, play a card, <a href=\"https://www.youtube.com/watch?v=mdk4_9xm8XU\">Don't Get Eliminated!</a>  Love Letter is not chess but it is good after one has over-indulged on, say, margaritas.",
      "dateUpdated": "11 Sep 2018"
    },
    "LYNGK": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 30,
      "photo": "LYNGK.jpg",
      "comment": "Billed as the culmination of the <a href=\"http://www.gipf.com/\" target=\"_blank\">GIPF project</a> (Christ, that website is grungier than mine!  Is it supposed to be some kind of geocities page?), LYNGK is a 2 player abstract game where ownership of the pieces is determined throughout the course of play.  I think it's pretty cool to see how aspects of some of the GIPF games (I own three) made their way into this design and I'm excited to explore the unique mechanics this game introduces, like the delayed ownership bit, with some more sessions.",
      "dateUpdated": "15 Sep 2018"
    },
    "Maria": {
      "minplayers": 3,
      "maxplayers": 3,
      "duration": 180,
      "photo": "Maria.jpg",
      "comment": "In my senior year of college, I lived above a couple that liked to blast Brooks & Dunn's My Maria (not linked here for obvious public health reasons).  I can't think of a game <i>more oblique</i> to the sentiment of that song than this one despite sharing a name.  This Maria is a 3 player war game with two sides.  It's really two 2 versus 1 battles with one player having to maintain the cognitive dissonance of both supporting and attacking each opponent.  I'd really like to find 2 people and 3 hours to give this a shot if you like what you see PLEASE let me know.  I promise not to have Brooks & Dunn on the bose.  I mean, Brooks and/or Dunn refers to his/their Maria as a 'juicy lady'.  Is that a thing people like being called?",
      "dateUpdated": "15 Sep 2018"
    },
    "Medici": {
      "minplayers": 3,
      "maxplayers": 6,
      "duration": 45,
      "photo": "",
      "comment": "A lovely auction game where money is victory points and victory points are money.  This game adds a real sense of timing to the already delightful challenge of accurately assessing the value of a set of goods.  This is one of the few 'great with 6 player' games that don't take a whole afternoon--in fact it's great at all player counts!",
      "dateUpdated": "22 Sep 2018"
    },
    "Mexica": {
      "minplayers":2,
      "maxplayers":4,
      "duration":75,
      "photo": "Mexica.jpg",
      "comment": "Mexica is a game in which you carve up an island with canals and then try to take control of those smaller islands with sweet resin temples.  I love the way the board always starts exactly the same but through the machinations of the players will always end up completely different.  To win a game of Mexica, you have to have vision and a certain taste for blood as blocking your fellow Aztecs from escaping one of their new islands is a very smart and very fun move.",
      "dateUpdated": "21 Sep 2018"
    },
    "Mogul": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 45,
      "photo": "",
      "comment": "I picked this up because it was billed as a better No Thanks with trains and for the most part I think that's true.  However the added train/share mechanic does push this game from the filler-land No Thanks lives in to a longer time commitment.  The nice wooden bowl in the box doesn't do much for me either.  It is a lovely wooden bowl but it obscures the game play a bit.  Let's play this more so we can get the playing time down to filler levels and it can take its rightful place in the pre-big game cannon.",
      "dateUpdated": "22 Sep 2018"
    },
    "Mykerinos": {
      "minplayers": 3,
      "maxplayers": 4,
      "duration": 45,
      "photo": "Mykerinos.jpg",
      "comment": "If you've ever wanted to pretend to have a Masters in Museology like Shana does, Mykerinos is probably your cheapest option.  The idea is you archaeologically dig in some desert sites to bring home valuable artifacts to display in a museum.  Through your efforts, you recruit various patrons who allow you to be more effective in your digs and also reward you for how valuable said artifacts can be.  In the game, this equates to an area control battle and management of various accumulated player powers.  It's not a ground breaker but it offers a lot in an easy to digest pacakge.  Plus I have an expansion to this game that's supposed to take it another level and I'm hoping enough people get into it that I can bring that expansion into play.",
      "dateUpdated": "23 Sep 2018'"
    },
    "No Thanks!": {
      "minplayers": 3,
      "maxplayers": 5,
      "duration": 20,
      "photo": "NoThanks.jpg",
      "comment": "A game that affords you the opportunity to be very polite and also very rude!",
      "dateUpdated": "11 Sep 2018"
    },
    "Norenberc": {
      "minplayers": 2,
      "maxplayers": 5,
      "duration": 90,
      "photo": "",
      "comment": "A game I've not yet played but this game was designed byt he same fella who did my favorite game Hansa Teutonica AND this game has cupcake meeples.  Maybe I'll make Taylor play it tomorrow.",
      "dateUpdated": "25 Sep 2018"
    },
    "Parade": {
      "minplayers": 2,
      "maxplayers": 6,
      "duration": 45,
      "photo": "Parade.jpg",
      "comment": "A card game with simple rules about throwing the best parade ever.  I mostly prefer it at 2 players (it is more strategic at that count) but it can still be a good time with larger groups.  Each turn you must add someone to the end of the parade from your hand of cards but your choice of addition may irritate those already marching&mdash;did you add someone younger or wearing the same outfit?  Participants may leave the parade in uproar and you are responsible for their hurt feelings.<br/><br/>Sometimes this game can feel like just choosing to do the least bad of all terrible options but it's still kinda fun to see your opponent get stuck with heaps of points (points being bad in this game) or turn what at first glance appears to be unmitigated disaster into something that's only a small disaster.",
      "dateUpdated": "10 Sep 2018"
    },
    "Patchwork": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 30,
      "photo": "Patchwork.jpg",
      "comment": "In Patchwork, the name of the game (besides Patchwork) is buttons!  Patchwork is about building up a button empire through judicious quilt making.  A quick two-player game in which the players try to fill up a board with variously sized tetris pieces.  There's more than just the challenge of filling up the board as each piece costs time and buttons but can also add to your button income which adds a bit of strategy to the spatial puzzle.",
      "dateUpdated": "14 Sep 2018"
    },
    "Pelican Cove": {
      "minplayers": 2,
      "maxplayers": 5,
      "duration": 30,
      "photo": "PelicanCove.jpg",
      "comment": "Pelican Cove is either the less freewheeling sibling to this same designer's <b><a href=\"/collection/Xalapa\">Xalapa</a></b>.  In this game your goal is to put 8 pelicans on a set of nests in accordance with a set of rules.  For each rule you fail to satisfy you get a penalty.  Everyone's board is the same and each round's maximum penalty is lower (well, unless you flip the rules board over then I guess you're dealing with some serious insanity).  Even playing this on the 'easiest' difficulty still brings out the cussin'.  There's little more satisfying than flipping the timer on your opponents and hearing a chorus of F-bombs.",
      "dateUpdated": "15 Sep 2018"
    },
    "Port Royal": {
      "minplayers": 2,
      "maxplayers": 5,
      "duration": 20,
      "photo": "PortRoyal.jpg",
      "comment": "Port Royal's mise en scène is a bustling harbor that sees ships carrying free gold coming to dock and sundry citizens selling their labor.  The game is a deck of 120 cards and turns involve revealing cards from the deck one at a time until the active player wants to stop.  The tension here is that revealing two ships of the same color ends your turn so you may hear some players shout \"<a href=\"https://www.youtube.com/watch?v=fnTbO26u9bQ\">Big bucks, no whammies, no whammies!</a>\" as they push their luck, trying to find a ship that carries a lot of gold or a worker they'd really like to add to their employ.",
      "dateUpdated": "14 Sep 2018"
    },
    "Race for the Galaxy": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 30,
      "photo": "",
      "comment": "Who knew a game where you have so little player interaction would be such a board game version of a BOP?  Also the kind of game where seeing a picture of it may make you less likely to want to play.  Trust me, though, it's a good time.  TRUST ME.",
      "dateUpdated": "11 Sep 2018"
    },
    "Sol: Last Days of a Star": {
      "minplayers":2,
      "maxplayers":5,
      "duration": 60,
      "photo": "Sol.jpg",
      "comment": "I picked this game up after seeing the gorgeous board and tales of unique game play.  The idea is we are trying to harvest a dying sun's energy to make sure the Ark we're building to save humanity has enough gas to, as Mariah Carey says, GTFO.  Throughout the course of the game, players will set up buildings in various levels of the sun's atmosphere and using those buildings to harvest energy and gather resources.  The couple of fun twists are 1) you can use other people's buildings as well, 2) your 'home base' rotates the sun and 3) The closer (and more valuably) you build your buildings, the more likely you are going to push the supernova endgame condition.  I've only played it twice but it's delightful so let's play it again.",
      "dateUpdated": "20 Sep 2018"
    },
    "Star Cartel": {
      "minplayers": 3,
      "maxplayers": 6,
      "duration": 30,
      "photo": "StarCartel.jpg",
      "comment": "Star Cartel is a commodity speculation game that takes place in... I wanna say Space Miami of the Future?  Load up your ships and then sell off the goods but you get to take a sampling of the merchandise for your own.  At the end, you'll get money based on your hoarded goods and the value of them on the marketplace.  The whack (and fun) thing about this game is that if a type of good gets really valuable, it's likely to come crashing down.  Very fun to do to your opponents, not so fun when your hoarded chocolate no longer has any black market value.",
      "dateUpdated": "13 Sep 2018"
    },
    "Targi": {
      "minplayers": 2,
      "maxplayers": 2,
      "duration": 60,
      "photo": "Targi.jpg",
      "comment": "The 21st Century has gone kind of nuts with boardgames wherein a player receives resources for playing a piece on a space and then later turns a combination of resources into victory points.  Targi is squarely in this genre known as Worker Placement and it adds a bit of Set Collection in there as well.  Knowing that there are thousands of games built upon this framework, why would one want to play Targi instead of the others (ludologically, I mean.  Of course <i>you</i> would play it because your minor in African Studies ignited a curiosity for all things Tuareg)?  Targi spices (or salts) things up by adding a layer of spatial strategy between the 'playing a piece on a space' and 'receiving resources' bit described above.  You'll just have to agree to play this game with me to figure out the details of that last statement.",
      "dateUpdated": "13 Sep 2018"
    },
    "Through the Desert": {
      "minplayers": 2,
      "maxplayers": 5,
      "duration": 20,
      "photo": "ThroughTheDesert.jpg",
      "comment": "I got this game cheap and used on an off-hand recommendation from some various online nerd and never particularly gave it a thought.  However, now that I've played it a few times two-player, I have been smitten.  First off, it's cute and second off, it's mean.  That's my favorite combo in a game.  In the game, you use your camels to try to snatch up valuable watering holes, oases, and territory.  In some sense, it's like the venerable game Go with camels and chrome.  Which is pretty much the only way you'd get me to play Go.",
      "dateUpdated": "27 Sep 2018"
    },
    "Ticket to Ride: Nordic Countries": {
      "minplayers": 2,
      "maxplayers": 3,
      "duration": 30,
      "photo": "TicketToRideNordicCountries.jpg",
      "comment": "Ticket to Ride, a member of the gateway game trinity with Carcassonne and Settlers of Catan, is a track layin', route claimin' game of a good time.  The Nordic Countries version is my favorite (and the only one I still own) because it's a tighter map (more blocking fun) and it takes place in my ancestors Nordic homeland.  There are some wonky rules that make a first play a little 'what?' but I like to play even though I lose most of the time.",
      "dateUpdated": "27 Sep 2018"
    },
    "Traders of Genoa": {
      "minplayers": 4,
      "maxplayers": 5,
      "duration": 90,
      "photo": "",
      "comment": "I got Traders of Genoa after reading a description that described its gameplay as being purely based on negotiation.  I think, at the time, I was job hunting and was nervous that 'don't accept the first offer' wasn't going to be enough to see me through salary negotiations.  Obviously, and not indicative of mental illness at all, I thought buying this board game would be a good professional development move.",
      "dateUpdated": "25 Sep 2018"
    },
    "Troyes": {
      "minplayers": 2,
      "maxplayers": 4,
      "duration": 60,
      "photo": "Troyes.jpg",
      "comment": "In 2011 I partook in an online board game Secret Santa and received this game and have loved it ever since!  It's a dice rolling worker placement game that allows you to hire away workers from your opponents.  It is an intricate yet elegant game.",
      "dateUpdated": "16 Sep 2018"
    },
    "Xalapa": {
      "minplayers": 2,
      "maxplayers": 6,
      "duration": 30,
      "photo": "Xalapa.jpg",
      "comment": "Similar to the same designer's <b><a href=\"/collection/Pelican Cove\">Pelican Cove</a></b>, Xalapa offers up competitive puzzle solving with a vaguely Andean(?) theme. Similar to Pelican Cove, you are given a set of rules you need to satisfy with stones on a checkered board.  Unlike Pelican Cove, there is a much higher ceiling on the maximum penalty one can be hit with becasue not only are you penalized for failing to satisfy a rule, you are also given points for each stone you use.  Also the board is much harder to read.  This usually means a lot more swear words and a bit more mental sweat.",
      "dateUpdated": "15 Sep 2018"
    }
  }
}
