{
  "sessions": [
    {
      "date": "27 Sep 2018",
      "comments": [
        {
          "game": "",
          "quantity": 0,
          "players": {},
          "comment": "Oh hello there!  Welcome to today's special 'avoid watching an asshole (allegedly) perjure himself in front of congress' edition of Ludic Tendencies!  Seems we haven't had this opportunity since Kirstjen Nielsen went to the hill.  It seems like just a short hundred years ago when Jeff Sessions helped inaugurate this practice (well, at least for this 'administration')."
        },
        {
          "game": "The Bridges of Shangri-La",
          "quantity": 1,
          "players": {
            "Mike": 0,
            "Joe": 1,
            "Taylor": 0
          },
          "comment": "Anyway, you're not coming here (just) for the hot political takes, you're coming here for BOARD GAMING SESSION REPORTS!  I am happy to session report that three of us had a game of <b><a href=\"/collection/The Bridges of Shangri-La\" target=\"_blank\">The Bridges of Shangri-La</a></b>.  We were throwing our masters and students around the mountain side and burning bridges left and right.  Mike and Taylor had a bit of a 'it's getting personal' moment that protected me just enough to secure some footing for my masters and I managed to win the maiden voyage of this game we all agreed we'd be happy to play again."
        },
        {
          "game": "Ticket to Ride: Nordic Countries",
          "quantity": 1,
          "players": {
            "Taylor": 1,
            "Joe": 0
          },
          "comment": "Then, I trotted out <b><a href=\"/collection/Ticket to Ride: Nordic Countries\" target=\"_blank\">Ticket to Ride: Nordic Countries</a></b> because sometimes it's just good to know you're going to lose.  Taylor blocked off any access to Copenhagen early which made two of my ticket cards no better than an albatross around my neck (I swear this is the second time this WEEK I've thought about Samuel Taylor Colerdige).  I also knew it was getting bad when Taylor would draw tickets, keep two, and then use her next turn to draw tickets.  Short story short, she won by 60+ points?"
        },
        {
          "game": "Azul",
          "quantity": 1,
          "players": {
            "Taylor": 0,
            "Joe": 1
          },
          "comment": "Next, Taylor and I did some mosaic building in <b><a href=\"/collection/Azul\" target=\"_blank\">Azul</a></b>.  We played on the 'advanced' side which allowed me to quickly put myself in a situation of it being impossible to fill up one of my columns.  However, I managed to stick Taylor with enough 'broken tile' negative points to withstand her 3-columns-completed onslaught and squeak out a victory by 2 or 3 points.  Was one of our few games that actually saw the bag get refilled with tiles before the end."
        },
        {
          "game": "Through the Desert",
          "quantity": 3,
          "players": {
            "Taylor": 0,
            "Joe": 3
          },
          "comment": "I had recently been converted to believing in <b><a href=\"/collection/Through the Desert\" target=\"_blank\">Through the Desert</a></b> as a two player game and wanted to see if Taylor could get over her fear of hexes and camels in board games.  We played a set of three games, all pretty close, but in each I had one caravan secure a sizable chunk of the board to protect from any 'longest caravan' bonuses Taylor scooped up.  This continues to be a charming, great game."
        },
        {
          "game": "Lost Cities",
          "quantity": 1,
          "players": {
            "Taylor": 0,
            "Joe": 1
          },
          "comment": "And, to finish the morning, Taylor and I played <b><a href=\"/collection/Lost Cities\" target=\"_blank\">Lost Cities</a></b>.  'I don't know why or when we started playing this game, but I'm sure glad we did.' -Ms. Taylor.  A standard three hand game with Taylor taking an early lead in points with three successful expeditions.  I managed a 30-pointer expedition in round two and barely held on for the win by a whopping 2 points in the end.  Of course I felt like I was having the match of my <i>life</i> and barely won.  Taylor is no joke in this game so I will cherish this win because likely the world will end in climate disaster before another one comes along."
        }
      ]
    },
    {
      "date": "23 Sep 2018",
      "comments": [
        {
          "game": "",
          "quantity": 0,
          "players": {},
          "comment": "Today's blogging was brought to you by the Spotify radio station inspired by <a href=\"https://open.spotify.com/track/2u5hIEYkD7sGXh7vgOxf73?si=4XiJ3kdLQOyJcS9sSCdsaA\" target=\"_blank\">CHVRCHES - Heaven/Hell</a>.  Dance while you read these session reports"
        },
        {
          "game": "Race for the Galaxy",
          "quantity": 2,
          "players": {
            "Landon": 0,
            "Joe": 2
          },
          "comment": "Listen y'all, I know my collections notes on <b><a href=\"/collection/Race for the Galaxy\" target=\"_blank\">Race for the Galaxy</a></b> may not exactly inspire desire, but thankfully Landon is 'game' enough to take this journey with me.  He's educating himself on an AI program with, as he says, a 'simplified' deck but he still puts up a nice challenge.  First round, I could not find the Mining guild my initial hand seemed to indicate would be perfect for me, but Landon couldn't find anything and I won despite being down in points in chips at the end of the round.  Second round, the score was very close as Landon tried to get a military engine going (but had some faulty math that caused him to lose some tempo) but I had a Galactic Federation that helped me spam some developments for the razor-wire win.  I had to Explore way too much in that 2nd game and without Landon's fuck up I would have been toast.  Here's hoping he keeps fucking up.  I'm a good sport!"
        },
        {
          "game": "Khmer",
          "quantity": 1,
          "players": {
            "Landon": 0,
            "Joe": 1
          },
          "comment": "We had, like, 5 minutes before Shana showed up so Landon and I did a quick <b><a href=\"/collection/Khmer\" target=\"_blank\">Khmer</a></b>.  My ESP must have been firing because I won 6-0.  I like to draw Landon into knocking when I have a perfect hand, which I think he knows because he never fell for the trap, but I was still able to manage to get the pot close enough to my hand's value to take the win.  My guess is the tide is about to turn on this one as Landon gets more hip to my strategic predilections..."
        },
        {
          "game": "Hab & Gut",
          "quantity": 1,
          "players": {
            "Joe": 1,
            "Landon": 0,
            "Shana": 0
          },
          "comment": "Basically without asking I foisted the Chinese language edition <b><a href=\"/collection/Hab & Gut\" target=\"_blank\">Hab & Gut</a></b> on Landon & Shana.  15% into our first game where we only could buy one share a turn we all felt like 'This can't be it...' and when I looked at the English translation, we were all correct.  It wasn't it.  We started again with the actual rules of being able to buy 1 to 3 shares and things spiced up <i>quite a bit</i>.  Shana found herself having not given enough to charity which meant she was DQ'd from win consideration and my lucky purchase of Corn going into the second round gave me the leg up on Landon to secure the V."
        },
        {
          "game": "Mykerinos",
          "quantity": 1,
          "players": {
            "Joe": 1,
            "Landon": 0,
            "Shana": 0
          },
          "comment": "Next we played one of my favorite 'older' and 'off the beaten path' games in <b><a href=\"/collection/Mykerinos\" target=\"_blank\">Mykerinos</a></b>.  I dutifully reminded Shana & Landon the value of 1) Mr. Brown and 2) Saving cubes for the final round and then we were off.  I secured a lot of patrons with few cubes in the first round while Landon & Shana secured some museum space but my gamble was the one to pay off in the end as an early Mr. Brown helped me make up for a lack of museum space and my cube advantage helped me grab the assistance of the other patrons as well.  I really hope they want to play this again and soon because I think this is a charming game."
        },
        {
          "game": "",
          "quantity": 0,
          "players": {},
          "comment": "Here's a brief cat picture interlude of the one second Puss was not whining about not getting enough attention.  What a sweety.<br/><br/><img src=\"photos/Puss_20180913.jpg\" />"
        },
        {
          "game": "Parade",
          "quantity": 2,
          "players": {
            "Joe": 1,
            "Shana": 0
          },
          "comment": "When it was down to me and Shana at the end of the afternoon, I suggested <b><a href=\"/collection/Parade\" target=\"_blank\">Parade</a></b>, one of my favorite quick 2-player card games.  Our first round ended with a tie on points and me barely winning the tie break 12-cards to 13.  In the second round, I was lucky enough to get hands that kept my points low while giving me opportunities to cut into Shana's majorities and I secured the win (this game can often come down to who gets shafted by the deal).  Shana did great for her first venture into parade planning and she will certainly be a formidable opponent going forward."
        }
      ]
    },
    {
      "date": "16 Sep 2018",
      "comments": [
        {
          "game": "Troyes",
          "quantity": 1,
          "players": {
            "Landon": 0,
            "Joe": 1
          },
          "comment": "Landon came over for games and JavaScript shop-talk on Sunday.  After I convinced him to take on one of the tasks I need done for this website we played a round of <b><a href=\"/collection/Troyes\" target=\"_blank\">Troyes</a></b>.  The event cards kept us hamstrung for most of the game (especially the expansion card we added in: The Resistance), and although Landon managed to get himself set up to have money his lack of influence kept his options rather limited.  I managed a well balanced strategy fighting off event cards, building the cathedral and even taking advantage of some level three activity cards.  I was paying through the nose for red dice but my hidden objective cards (influence and events) made that a pretty solid strategy.  I ended up winning and avenging my loss from last time."
        },
        {
          "game": "Chicago Express",
          "quantity": 1,
          "players": {
            "Landon": 0,
            "Taylor": 1,
            "Joe": 0
          },
          "comment": "Taylor joined us after an upsetting trip on the Broadway bridge over 94.  We set up one of my favorite games: <b><a href=\"/collection/Chicago Express\" target=\"_blank\">Chicago Express</a></b>.  I again broke my rule of 'Don't piss off Taylor' by rerouting our red line away from Chicago thus denying the company the extra dividend (she had two shares, I only had one.  It seemed like at least something <i>different</i>).  I also irritated everyone by auctioning off shares of their companies but never had the guts to bid enough money to get a hold of enough stocks.  I ended the game with only 3 stocks.  In comparison Landon had like 6 and Taylor 7 (maybe).  Regardless, Landon & Taylor finished with way more money than me and Taylor with more money than Landon making her the winner.  At one point I did tell Landon that money didn't count for anything at the end of the game.  I think my brain was briefly broken."
        },
        {
          "game": "Botswana",
          "quantity": 1,
          "players": {
            "Joe": 0,
            "Landon": 0,
            "Taylor": 1
          },
          "comment": "Nothing like dumping out a box full of plastic animals to keep the party poppin'.  The three of us next played <b><a href=\"/collection/Botswana\" target=\"_blank\">Botswana</a></b>.  Going into the final round the three of us were within 2 points of each other, then Taylor managed to end the round relatively early with her menagerie commanding a very strong lead.  This is a light game that I'm still trying to wrap my head around."
        },
        {
          "game": "Patchwork",
          "quantity": 1,
          "players": {
            "Joe": 0,
            "Taylor": 1
          },
          "comment": "Landon left us and I had time for a quick game of <b><a href=\"/collection/Patchwork\" target=\"_blank\">Patchwork</a></b> before heading off to the dinner theater.  Taylor nabbed the 7x7 bonus and covered up a good deal of her board while I managed to finish with a negative score.  I had a nice button income going but did not cover up enough of my quilt thus ending up with more of a pot holder.  Taylor wins and her reign of terror must be stopped, so someone with some gaming ability come help me!"
        }
      ]
    },
    {
      "date": "15 Sep 2018",
      "comments": [
        {
          "game": "Great Western Trail",
          "quantity": 1,
          "players": {
            "Caitlin": 1,
            "Joe": 0
          },
          "comment": "Oh man, did we land a big one this afternoon!  After prepping a baking sheet with fixin's for oven nachos, I presented Caitlin with the opportunity to try a game I had never played in <b><a href=\"/collection/Great Western Trail\" target=\"_blank\">Great Western Trail</a></b>.  I told her that it had taken me about three separate passes through the rule book to really 'get' what was happening, and that she'd have to be OK with not really knowing, strategically, what was going on.  She thought that actually sounded like  a fun adventure, bless her, so as we munched on our nachos I set about explaining the moving parts of the game.</p><p>We mostly kept close to each other's path but Caitlin's train and wallet always seemed to be a step ahead of mine.  I tried an early strategy of thinning the 1-value Jerseys from my deck, which likely helped but not as much as Caitlin's stable of Cowmen helped her.  In the end, her superior herd let her outdistance me in the score column 100-89.  She commented that it was fun to play a game in which she and I had equal amount of experience.  Looks like I have someone to try out all my unplayed games with!!"
        }
      ]
    },
    {
      "date": "14 Sep 2018",
      "comments": [
        {
          "game": "Fjords",
          "quantity": 1,
          "players": {
            "Erik": 0,
            "Joe": 1
          },
          "comment": "Blog!  Long time Ludocrat Erik stopped by and we celebrated our shared Norwegian heritage by playing the great 2-player game <b><a href=\"/collection/Fjords\" target=\"_blank\">Fjords</a></b>.  First round saw some maybe tentitive house placement from Erik (or perhaps I've just played this more recently) and I hopped out to a 4 point lead.  Second round, Erik adjusted and played a house on his first turn&mdash;he improved his net round score but didn't manage to cut into my lead.  The final round saw Erik snatch a valuable peninsula I couldn't find a way into, and he won the round by two but my inital four point win helped me hold on for the overall win."
        },
        {
          "game": "Biblios",
          "quantity": 3,
          "players": {
            "Erik": 2,
            "Joe": 1
          },
          "comment": "Next, we played another of my favorite games for two players in <b><a href=\"/collection/Biblios\" target=\"_blank\">Biblios</a></b>.  We played three matches all with their own flavor.  In the first match, I went into the auction phase with very little money but a strong hand.  I held on to take three colors and the win.  The second match started with church cards turning over for each of us before we had any idea of what colors we wanted to be valuable so for the most part we cancelled each other out.  I spent all my money on a 3-blue card only to have a 4-blue follow it with Erik able to buy it cheap.  He easily wins three colors and the match.  In our final round, Erik finds himself without any money going into the last half of the auction phase.  I have 6 points in yellow and red and 5 in green so assume I've got this in the bag and start crafting a victory blog post in my head.  Erik bids me to wait as he reveals he, too, has 5 points in green AND the 'A' card to win the tie-break.  Plus he has blue and brown wrapped up, handing me the defeat.  I am heart broken and writing this through tears."
        }
      ]
    },
    {
      "date": "11 Sep 2018",
      "comments": [
        {
          "game": "Race for the Galaxy",
          "quantity": 2,
          "players": {
            "Annie": 0,
            "Joe": 2
          },
          "comment": "Are we really tryin'a blog right now?  Yes.  We are.  And what better way to initiate a new blog that I will eventually delete than with two games of latest fave for Annie and me in <b><a href=\"/collection/Race for the Galaxy\" target=\"_blank\">Race for the Galaxy</a></b>.  The agony and ecstasy in this game is that there is a lot to learn.  Matches usually only last 20 minutes, however, so one can usually take one's lumps and quickly turn around and apply those lessons to another match</p><p>Annie recently learned how to wield the x2 Consume power to her advantage and that new found power was on display in our first match.  Unfortunately for her, I was thinking the same thing and had a slight edge on consume powers so was able to out pace her just enough to win the match.  Then, to show me she wasn't kidding with the x2 Consume, she leapt out to a 9 point lead in chips in match two (compared to my, count it, 0) but some <a href=\"https://www.youtube.com/watch?v=Dy8gHfGIS_A\" target=\"blank\">nick of time</a> draws of strong cards gave me a strong enough tableau to take the win.  A post-mortem review of strategy over some Miraculum ended the day and Annie is fittin' to come back swinging next time she and I get this to the table which will, likely and hopefully, be soon."
        }
      ]
    }
  ]
}